# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'clintmod/formulas/macprefs'
brew 'mas' # Mac App Store manager
brew 'wget'

# Development
brew 'node'
brew 'redis'
brew 'yarn'
brew 'withgraphite/tap/graphite'

# Apps
cask "atom"
cask 'brave-browser'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'gifox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'lockdown'
cask 'loom'
cask 'mimestream'
cask 'mongodb-compass'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tuple'
cask 'visual-studio-code'
cask 'windscribe'
cask 'zoom'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
