# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'clintmod/formulas'
tap 'withgraphite/tap'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'macprefs'
brew 'mas' # Mac App Store manager
brew 'wget'

# Development
brew 'node'
brew 'redis'
brew 'yarn'
brew 'graphite'

# Apps
# cask "atom" # No longer supported :(
cask 'brave-browser'
cask 'docker'
# cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'gifox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'loom'
cask 'mimestream'
cask 'mongodb-compass'
cask 'postman'
cask 'spotify'
cask 'the-unarchiver'
cask 'tuple'
cask 'visual-studio-code'
cask 'windscribe'
cask 'zoom'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Lockdown', id: 1483255076
mas 'Brother iPrint&Scan', id: 1193539993
mas 'Developer', id: 640199958
mas 'Honey', id: 1472777122
mas 'Magnet', id: 441258766
mas 'Grammarly for Safari', id: 1462114288
mas 'GIPHY CAPTURE', id: 668208984
mas 'Be Focused Pro', id: 961632517
mas 'AdBlock Pro', id: 1018301773
mas 'Speedtest', id: 1153157709
mas 'Xcode', id: 497799835
mas 'Bear', id: 1091189122
mas 'Slack', id: 803453959
